PaxonHuang/EchoGlove-SLR-MOCAP-Beta/glove_firmware/p4_base_station/p4_firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_ESP_CONSOLE_USB_CDC=y

# TinyUSB CDC (USB HS for P4→PC relay)
CONFIG_TINYUSB=y
CONFIG_TINYUSB_TASK_ENABLED=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_VENDOR_STR="EchoGlove"
CONFIG_TINYUSB_PRODUCT_STR="P4 Base Station"

# LVGL + PSRAM (LVGL buffer allocation on P4 EV Board 7" MIPI-DSI)
CONFIG_BSP_LCD_TYPE_1024_600=y
CONFIG_BSP_GRAPHICS_LVGL=y
CONFIG_LV_COLOR_DEPTH_16=y

# SD card (FAT filesystem for /sdcard/tts/*.pcm)
CONFIG_FATFS_LONG_FILENAME=y
